<img src="../dsi.png" style="height:128px;">

## Lesson 4: Tables

Today, we gathered data and organized it into a *table.* Let's now look at how we can represent tables in Python.

## Tables

Think back to the first session. We did a lot of work with *tables*. Think of tables as an organized way of representing data. Tables have *rows* (read horizontally) and *columns* (read vertically).

Rows contain all the data about one item in the table, and columns represent one *attribute* of our data set. Here's an example.

In [4]:
students = Table().with_columns("Name", np.array(["Rohan", "Meena", "Priya", "Ahmed"]),
                     "Age", np.array([18, 16, 17, 15]),
                     "Favorite Activity", np.array(["Tabla", "Football", "Sitar", "Cricket"]),
                     "Favorite Fruit", np.array(["Mango", "Lychee", "Guava", "Mango"]))
students

Name  | Age  | Favorite Activity | Favorite Fruit
Rohan | 18   | Tabla             | Mango
Meena | 16   | Football          | Lychee
Priya | 17   | Sitar             | Guava
Ahmed | 15   | Cricket           | Mango

Try seeing if you can fill in this table with data about yourself and three other students.

In [ ]:
names = np.array(["_______", "_______", "__________", "_________"])
ages = np.array([_______, ______, ________, ________])
activities = np.array(["_______", "_______", "__________", "_________"])
fruits = np.array(["_______", "_______", "__________", "_________"])

your_data = Table().with_columns("Name", names,
                     "Age", ages,
                     "Favorite Activity", activities,
                     "Favorite Fruit", fruits)

In Python, we can write expressions to help us work with tables.

To access data in a column, we can say the following statements. We have to refer to the table by name before calling the *column* function, otherwise Python won't know which table we're referring to!

In [39]:
students.column(0)

array(['Rohan', 'Meena', 'Priya', 'Ahmed'],
      dtype='<U5')

In [40]:
your_data.column("Name")

array(['Rohan', 'Meena', 'Priya', 'Ahmed'],
      dtype='<U5')

Note how we were able to pass in the column name, as well as its position in the table (it's the first column and we count from zero), to get an array of the names. Let's try something a little harder. How would you find the average age of the students in your table?

In [ ]:
np.average(_______________)

Python can also show us how many entries are in our table with the num_rows call. Here, we can see that our table contains data about four people.

In [50]:
students.num_rows

4

Sometimes, we need to *sort* our data by putting it into a meaningful order. Say we want to find the name of the oldest student.

In [41]:
students.sort("Age", descending = True).column("Name")[0]

'Rohan'

Write a line of code that sorts your table such that the youngest student is on top.

Suppose you're at a marketing company trying to see what people your age are interested in. Here's where the *select* statement comes in handy.

In [42]:
students.select("Favorite Fruit", 2)

Favorite Fruit | Favorite Activity
Mango          | Tabla
Lychee         | Football
Guava          | Sitar
Mango          | Cricket

Select one or two columns from your table here.

Let's add a column to our table.

In [5]:
t2 = students.with_column("Activity Type", np.array(["Music", "Sport", "Music", "Sport"]))
t2

Name  | Age  | Favorite Activity | Favorite Fruit | Activity Type
Rohan | 18   | Tabla             | Mango          | Music
Meena | 16   | Football          | Lychee         | Sport
Priya | 17   | Sitar             | Guava          | Music
Ahmed | 15   | Cricket           | Mango          | Sport

You can also look at data that satisfies a certain condition with the *where* function. In this example, you're the school's coach and want to look for players to pick for the sports teams with the following clause.

In [48]:
t2.where("Activity Type", are.equal_to("Sport"))

Name  | Age  | Favorite Activity | Favorite Fruit | Activity Type
Meena | 16   | Football          | Lychee         | Sport
Ahmed | 15   | Cricket           | Mango          | Sport

Find the people in your table who are older than 16. Hint: Use the "are.greater_than" function.

To see how many people like each type of activity, we can use the *group* function.

In [6]:
t2.group("Activity Type")

Activity Type | count
Music         | 2
Sport         | 2

We also have a table about the students' favorite subjects and their teachers.

In [9]:
teachers = Table().with_columns("Name", np.array(["Rohan", "Meena", "Priya", "Ahmed"]),
                               "Subject", np.array(["Math", "Math", "Physics", "History"]),
                               "Teacher", np.array(["Dasgupta", "Dasgupta", "Sahay", "Bakhle"]))
teachers

Name  | Subject | Teacher
Rohan | Math    | Dasgupta
Meena | Math    | Dasgupta
Priya | Physics | Sahai
Ahmed | History | Bakhle

If you just had the *students* table, you wouldn't be able to tell what subject anyone liked. However, if you use the *join* function, you can have *all* the information about the students in one table.

In [11]:
students.join("Name", teachers, "Name")

Name  | Age  | Favorite Activity | Favorite Fruit | Subject | Teacher
Ahmed | 15   | Cricket           | Mango          | History | Bakhle
Meena | 16   | Football          | Lychee         | Math    | Dasgupta
Priya | 17   | Sitar             | Guava          | Physics | Sahai
Rohan | 18   | Tabla             | Mango          | Math    | Dasgupta

Fill in the appropriate information.

In [ ]:
subjects = np.array(["_______", "_______", "__________", "_________"])
teachers = np.array(["_______", "_______", "__________", "_________"])

your_teachers = Table().with_columns("Name", names,
                     "Subject", subjects,
                     "Teacher", teachers)

Join your table with the one above.